cf_billing/InformationRegisters/бестКоэффициентыНарушений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестКоэффициентыНарушений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КоличествоНарушенийОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КоличествоНарушенийДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНегативноеВоздействие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНегативноеВоздействие</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестКоэффициентыНарушений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет коэффициент негативного воздействия.
//
// Параметры:
//  ДокументНарушение	-	ДокументСсылка.бестИзменитьДанныеДляДополнительногоРасчета.
//  ОтборСтруктура		-	Структура.
// 
// Возвращаемое значение:
//   Число.
//
Функция ОпределитьКоэффициентНегативногоВоздействия(ДокументНарушение, ОтборСтруктура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(бестНегативноеВоздействие.Период) КАК КолвоНарушений
		|ПОМЕСТИТЬ ВТ_КолвоНарушений
		|ИЗ
		|	РегистрСведений.бестНегативноеВоздействие КАК бестНегативноеВоздействие
		|ГДЕ
		|	бестНегативноеВоздействие.Период МЕЖДУ &ПериодНачало И &ПериодКонец
		|	И бестНегативноеВоздействие.ОбъектРасчета = &ОбъектРасчета
		|	И бестНегативноеВоздействие.ТочкаУчета = &ТочкаУчета
		|	И бестНегативноеВоздействие.Услуга = &Услуга
		|	И бестНегативноеВоздействие.Регистратор <> &ДокументНарушение
		|	И бестНегативноеВоздействие.Организация = &Организация
		|	И бестНегативноеВоздействие.Район = &Район
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_КолвоНарушений.КолвоНарушений, 0) + 1 КАК КолвоНарушений
		|ПОМЕСТИТЬ ВТ_КолвоНарушенийРезультат
		|ИЗ
		|	ВТ_КолвоНарушений КАК ВТ_КолвоНарушений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестКоэффициентыНарушенийСрезПоследних.Коэффициент КАК Коэффициент
		|ИЗ
		|	ВТ_КолвоНарушенийРезультат КАК ВТ_КолвоНарушенийРезультат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестКоэффициентыНарушений.СрезПоследних(&ПериодКонец, Организация = &Организация) КАК бестКоэффициентыНарушенийСрезПоследних
		|		ПО ВТ_КолвоНарушенийРезультат.КолвоНарушений >= бестКоэффициентыНарушенийСрезПоследних.КоличествоНарушенийОт
		|			И (ВТ_КолвоНарушенийРезультат.КолвоНарушений < бестКоэффициентыНарушенийСрезПоследних.КоличествоНарушенийДо
		|				ИЛИ бестКоэффициентыНарушенийСрезПоследних.КоличествоНарушенийДо = 0)";
	
	Запрос.УстановитьПараметр("ДокументНарушение", 	ДокументНарушение);
	Запрос.УстановитьПараметр("ОбъектРасчета", 		ОтборСтруктура.ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация", 		ОтборСтруктура.Организация);
	Запрос.УстановитьПараметр("ПериодКонец", 		ОтборСтруктура.Дата);
	Запрос.УстановитьПараметр("ПериодНачало", 		ДобавитьМесяц(ОтборСтруктура.Дата, -12));
	Запрос.УстановитьПараметр("Район", 				ОтборСтруктура.Район);
	Запрос.УстановитьПараметр("ТочкаУчета", 		ОтборСтруктура.ТочкаУчета);
	Запрос.УстановитьПараметр("Услуга", 			ОтборСтруктура.Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Коэффициент;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли
